/*
 * Практическое задание по теме “Оптимизация запросов”
 * 
 * Задание №1. Создайте таблицу logs типа Archive. 
 * Пусть при каждом создании записи в таблицах users, catalogs и products в таблицу logs помещается время и дата создания записи, 
 * название таблицы, идентификатор первичного ключа и содержимое поля name.
 * 
*/

DROP TABLE IF EXISTS  logs;

CREATE TABLE IF NOT EXISTS logs (
  id SERIAL ,
  message varchar(255) COMMENT 'Сообщение журнала',
  created_at datetime DEFAULT CURRENT_TIMESTAMP) ENGINE=ARCHIVE AUTO_INCREMENT=1 COMMENT 'Журнал операций';

# Создаем триггеры log_users_insert log_catalogs_insert log_products_insert см. отделльные sql файлы

 
# Вставляем запись в таблицу users
INSERT INTO users(name,birthday_at) VALUES ('Leo','1992-08-15');
INSERT INTO catalogs(name) VALUES ('Периферийные устройства');
INSERT INTO products(name,description,price,catalog_id) VALUES ('Xerox WorkCentre 3025BI','Xerox WorkCentre 3025BI МФУ (принтер, сканер, копир)',18000,8);

SELECT * FROM logs;

# Результат
/*
 * +----+------------------------------------------------------------------------------------------+---------------------+
 * | id | message                                                                                  | created_at          |
 * +----+------------------------------------------------------------------------------------------+---------------------+
 * |  1 | Insert new user =Leo at 2020-12-18 04:50:28                                              | 2020-12-18 04:50:28 |
 * |  2 | Insert new catalog =Периферийные устройства at 2020-12-18 05:00:54                       | 2020-12-18 05:00:54 |
 * |  3 | Insert new product =Xerox WorkCentre 3025BI at 2020-12-18 05:01:24                       | 2020-12-18 05:01:24 |
 * +----+------------------------------------------------------------------------------------------+---------------------+
 * 3 rows in set (0.00 sec)
 */




 /*
 * Практическое задание по теме “Оптимизация запросов”
 * 
 * Задание №2.  * (по желанию) Создайте SQL-запрос, который помещает в таблицу users миллион записей.
 * 
*/

# создаем процедуру pro_insert_user() см. pro_insert_user.sql

# Запускаем 
CALL pro_insert_user();
# Выполнялась удаленно на виртуальной машине скорость записи примерно 10973 в секунду


SELECT * from logs LIMIT 30;

/*
mysql> select * from logs limit 30;
+----+------------------------------------------------------+---------------------+
| id | message                                              | created_at          |
+----+------------------------------------------------------+---------------------+
|  1 | Insert new user = Leo at 2020-12-18 17:51:26         | 2020-12-18 17:51:26 |
|  2 | Insert new user = User_685_1 at 2020-12-18 17:54:27  | 2020-12-18 17:54:27 |
|  3 | Insert new user = User_370_2 at 2020-12-18 17:54:27  | 2020-12-18 17:54:27 |
|  4 | Insert new user = User_868_3 at 2020-12-18 17:54:27  | 2020-12-18 17:54:27 |
|  5 | Insert new user = User_150_4 at 2020-12-18 17:54:27  | 2020-12-18 17:54:27 |
|  6 | Insert new user = User_39_5 at 2020-12-18 17:54:27   | 2020-12-18 17:54:27 |
|  7 | Insert new user = User_394_6 at 2020-12-18 17:54:27  | 2020-12-18 17:54:27 |
|  8 | Insert new user = User_133_7 at 2020-12-18 17:54:27  | 2020-12-18 17:54:27 |
|  9 | Insert new user = User_967_8 at 2020-12-18 17:54:27  | 2020-12-18 17:54:27 |
| 10 | Insert new user = User_178_9 at 2020-12-18 17:54:27  | 2020-12-18 17:54:27 |
| 11 | Insert new user = User_664_10 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 12 | Insert new user = User_7_11 at 2020-12-18 17:54:27   | 2020-12-18 17:54:27 |
| 13 | Insert new user = User_162_12 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 14 | Insert new user = User_1_13 at 2020-12-18 17:54:27   | 2020-12-18 17:54:27 |
| 15 | Insert new user = User_553_14 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 16 | Insert new user = User_504_15 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 17 | Insert new user = User_590_16 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 18 | Insert new user = User_676_17 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 19 | Insert new user = User_533_18 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 20 | Insert new user = User_28_19 at 2020-12-18 17:54:27  | 2020-12-18 17:54:27 |
| 21 | Insert new user = User_728_20 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 22 | Insert new user = User_571_21 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 23 | Insert new user = User_289_22 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 24 | Insert new user = User_351_23 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 25 | Insert new user = User_57_24 at 2020-12-18 17:54:27  | 2020-12-18 17:54:27 |
| 26 | Insert new user = User_916_25 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 27 | Insert new user = User_893_26 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 28 | Insert new user = User_715_27 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 29 | Insert new user = User_537_28 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 30 | Insert new user = User_760_29 at 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
+----+------------------------------------------------------+---------------------+
30 rows in set (0.01 sec)
*/

select * from users limit 30;
/*
+----+--------------------+-------------+---------------------+---------------------+
| id | name               | birthday_at | created_at          | updated_at          |
+----+--------------------+-------------+---------------------+---------------------+
|  1 | Геннадий           | 1990-10-05  | 2020-12-18 17:50:51 | 2020-12-18 17:50:51 |
|  2 | Наталья            | 1984-11-12  | 2020-12-18 17:50:51 | 2020-12-18 17:50:51 |
|  3 | Александр          | 1985-05-20  | 2020-12-18 17:50:51 | 2020-12-18 17:50:51 |
|  4 | Сергей             | 1988-02-14  | 2020-12-18 17:50:51 | 2020-12-18 17:50:51 |
|  5 | Иван               | 1998-01-12  | 2020-12-18 17:50:51 | 2020-12-18 17:50:51 |
|  6 | Мария              | 1992-08-29  | 2020-12-18 17:50:51 | 2020-12-18 17:50:51 |
|  7 | Leo                | 1992-08-15  | 2020-12-18 17:51:26 | 2020-12-18 17:51:26 |
|  8 | User_685_1         | 1974-04-21  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
|  9 | User_370_2         | 2000-05-03  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 10 | User_868_3         | 1998-01-16  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 11 | User_150_4         | 1974-12-23  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 12 | User_39_5          | 2015-12-24  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 13 | User_394_6         | 1983-05-24  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 14 | User_133_7         | 2014-06-22  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 15 | User_967_8         | 1980-12-23  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 16 | User_178_9         | 1982-03-04  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 17 | User_664_10        | 2000-07-17  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 18 | User_7_11          | 1982-01-17  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 19 | User_162_12        | 1974-12-06  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 20 | User_1_13          | 2006-03-22  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 21 | User_553_14        | 2002-03-26  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 22 | User_504_15        | 2001-08-08  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 23 | User_590_16        | 1974-07-17  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 24 | User_676_17        | 1975-09-15  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 25 | User_533_18        | 1986-07-19  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 26 | User_28_19         | 1978-03-30  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 27 | User_728_20        | 1977-08-29  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 28 | User_571_21        | 1990-05-17  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 29 | User_289_22        | 1982-05-23  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
| 30 | User_351_23        | 1971-02-01  | 2020-12-18 17:54:27 | 2020-12-18 17:54:27 |
+----+--------------------+-------------+---------------------+---------------------+
30 rows in set (0.00 sec)
*/

select count(*) from users;
/*
 * +----------+
 * | count(*) |
 * +----------+
 * |    65910 |
 * +----------+
 * 1 row in set (0.08 sec)*/


