#   Практическое задание по теме “NoSQL”
#   Задание №1. В базе данных Redis подберите коллекцию для подсчета посещений с определенных IP-адресов.
#
import redis

if __name__ == '__main__':

    r_list = redis.Redis(host = '192.168.88.250', port = 6379) # Создаем обьект и соединяемся с Redis

    i = r_list.llen('ip')   # Получаем колво элементов в списке ip
    list_ip = r_list.lrange('ip',0,i-1) # Читаем список из базы
    for idx,n in enumerate(list_ip):        # Выводми на печать содержимое списка
        print(f'{idx}. {str(n,"utf8")}')

    # Вводим искомый IP адрес
    ip_search = input('Введите искомый IP:\n')
    print(f'Вхождений этого IP = {ip_search} в списке базы Redis равно {list_ip.count(str.encode(ip_search))}') # Выводим на печать кол-во вхождений данного ip в список

# Результат работы скрипта
#
# C:\Python3\python.exe D:/edu/mysql_20201110/lesson11/redisdb.py
# 0. 10.2.1.7
# 1. 10.2.1.8
# 2. 10.2.1.1
# 3. 10.2.1.5
# 4. 10.2.1.2
# 5. 10.2.1.4
# 6. 10.2.1.3
# 7. 10.2.1.2
# 8. 10.2.1.5
# 9. 10.2.1.2
# 10. 10.2.1.4
# 11. 10.2.1.3
# 12. 10.2.1.2
# Введите искомый IP:
# 10.2.1.2
# Вхождений этого IP = 10.2.1.2 в списке базы Redis равно 4
#
# Process finished with exit code 0